import mongoose from "mongoose";
import dotenv from "dotenv";
import StoreModel from "./models/store-model.js";

dotenv.config();

// const categories = [
//   {
//     "name": "Автозапчастини",
//     "image": "",
//     "subcategories": [
//       "Деталі двигуна",
//       "Гальмівна система",
//       "Підвіска та кермове управління",
//       "Трансмісія",
//       "Система охолодження",
//       "Система запалювання",
//       "Електрика та датчики",
//       "Вихлопна система",
//       "Паливна система",
//       "Кузовні деталі",
//       "Ступиці",
//       "ШРУС",
//       "Опора",
//       "Подушка двигуна"
//     ]
//   },
//   {
//     "name": "Гальмівна система",
//     "image": "",
//     "subcategories": [
//       "Гальмівні колодки передні",
//       "Гальмівні колодки задні",
//       "Гальмівні диски",
//       "Гальмівні барабани",
//       "Гальмівні шланги",
//       "Гальмівна рідина"
//     ]
//   },
//   {
//     "name": "Система запалювання",
//     "image": "",
//     "subcategories": [
//       "Свічки запалювання",
//       "Котушки та модулі запалювання",
//       "Високовольтні дроти"
//     ]
//   },
//   {
//     "name": "Електрика та датчики",
//     "image": "",
//     "subcategories": [
//       "Акумулятори",
//       "Датчики",
//       "Автомобільні реле",
//       "Запобіжники та перемикачі",
//       "Автомобільна проводка",
//       "Пуско-зарядні пристрої"
//     ]
//   },
//   {
//     "name": "Система охолодження",
//     "image": "",
//     "subcategories": [
//       "Радіатори",
//       "Охолоджуючі рідини",
//       "Вентилятори",
//       "Термостати",
//       "Помпи водяні"
//     ]
//   },
//   {
//     "name": "Фільтри",
//     "image": "",
//     "subcategories": [
//       "Оливні фільтри",
//       "Повітряні фільтри",
//       "Паливні фільтри",
//       "Салонні фільтри"
//     ]
//   },
//   {
//     "name": "Оливи та автохімія",
//     "image": "",
//     "subcategories": [
//       "Моторні оливи",
//       "Трансмісійні оливи",
//       "Гідравлічні оливи",
//       "Омивач скла зимовий",
//       "Омивач скла літній",
//       "Присадки",
//       "Гальмівна рідина",
//       "Дистильована вода",
//       "Електроліт",
//       "Автомобільні фарби, лаки та грунтовки"
//     ]
//   },
//   {
//     "name": "Екстер'єр",
//     "image": "",
//     "subcategories": [
//       "Оптика",
//       "Двірники",
//       "Автодзеркала та комплектуючі",
//       "Ковпаки",
//       "Ковпаки з емблемами",
//       "Автомобільні дефлектори",
//       "Декоративні накладки"
//     ]
//   },
//   {
//     "name": "Інтер'єр",
//     "image": "",
//     "subcategories": [
//       "Автомобільні килимки",
//       "Чохли, накидки, майки для автокрісел",
//       "Освіжувач повітря",
//       "Автомобільні дверні ручки"
//     ]
//   },
//   {
//     "name": "Шини та диски",
//     "image": "",
//     "subcategories": [
//       "Шини",
//       "Диски",
//       "Ковпаки",
//       "Ковпаки з емблемами"
//     ]
//   },
//   {
//     "name": "Автоелектроніка",
//     "image": "",
//     "subcategories": [
//       "Автомагнітоли",
//       "Автомобільні акумулятори",
//       "Пуско-зарядні пристрої",
//       "GPS-навігатори",
//       "Відеореєстратори",
//       "Парктроніки"
//     ]
//   },
//   {
//     "name": "Аксесуари",
//     "image": "",
//     "subcategories": [
//       "Автомобільні замки та ключі",
//       "Аксесуари для мототехніки",
//       "Освіжувач повітря",
//       "Автомобільні дефлектори",
//       "Декоративні накладки"
//     ]
//   },
//   {
//     "name": "Інструменти та обладнання",
//     "image": "",
//     "subcategories": [
//       "Автомобільні компресори",
//       "Автопилососи",
//       "Інструменти для ремонту",
//       "Домкрати",
//       "Зарядні пристрої"
//     ]
//   }
// ]

const addCategoriesToStore = async () => {
  try {
    await mongoose.connect(process.env.DB_URL);
    const storeMY = await StoreModel.findOne({ title: "AvtoSuperStar" });
    if (!storeMY) {
      throw new Error("❌ Магазин My не знайдено");
    }
    const storeMam = await StoreModel.findOne({ title: "Автотовари" });
    if (!storeMam) {
      throw new Error("❌ Магазин Mam не знайдено");
    }
    storeMam.categories = storeMY.categories.map((cat) => ({
      ...cat,
      name: cat.name.toUpperCase(),
      subcategories: cat.subcategories.map((sub) => sub.toUpperCase())
      .sort((a, b) => a.localeCompare(b, "uk")),
    })).sort((a, b) => a.name.localeCompare(b.name, "uk"));

    await storeMam.save();
    console.log("✅ Категорії успішно додані до магазину!");
    mongoose.disconnect();
  } catch (error) {
    console.error("❌ Помилка при додаванні категорій:", error.message);
    mongoose.disconnect();
  }
};

addCategoriesToStore();
